---
kind: property
id: P:Autodesk.Revit.DB.Visual.Water.WaterTintEnable
source: html/2989d221-1b73-770f-a30b-633cbb242364.htm
---
# Autodesk.Revit.DB.Visual.Water.WaterTintEnable Property

The property labeled "Color" from the "Water" schema.

## Syntax (C#)
```csharp
public static string WaterTintEnable { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterTintEnableType".